%% use MSE multi-classification to separate 
clear 
X1=[0.1 6.8 -3.5 2.0 4.1 3.1 -0.8 0.9 5.0 3.9];
Y1=[1.1 7.1 -4.1 2.7 2.8 5.0 -1.3 1.2 6.4 4.0];
X2=[7.1 -1.4 4.5 6.3 4.2 1.4 2.4 2.5 8.4 4.1];
Y2=[4.2 -4.3 0.0 1.6 1.9 -3.2 -4.0 -6.1 3.7 -2.2];
X3=[-3.0 0.5 2.9 -0.1 -4.0 -1.3 -3.4 -4.1 -5.1 1.9];
Y3=[-2.9 8.7 2.1 5.2 2.2 3.7 6.2 3.4 1.6 5.1];
X4=[-2.0 -8.9 -4.2 -8.5 -6.7 -0.5 -5.3 -8.7 -7.1 -8.0];
Y4=[-8.4 0.2 -7.7 -3.2 -4.0 -9.2 -6.7 -6.4 -9.7 -6.3];
%% 汇总构建行数为3的X矩阵，总列数为4*8
X_design=[X1(1:8) X2(1:8) X3(1:8) X4(1:8);Y1(1:8) Y2(1:8) Y3(1:8) Y4(1:8);ones(1,32)];
X_test  =[X1(9:10) X2(9:10) X3(9:10) X4(9:10);Y1(9:10) Y2(9:10) Y3(9:10) Y4(9:10);ones(1,8)];
Y=zeros(4,32);
Y(1,(1:8))=ones(1,8);
Y(2,(9:16))=ones(1,8);
Y(3,(17:24))=ones(1,8);
Y(4,(25:32))=ones(1,8);
%% the solution of W and classification of X_test
W=inv(X_design*(X_design.'))*X_design*(Y.');
Class_test=(W.')*X_test;
Class_result=zeros(1,8);
for i= 1:8
    Class_result(i)=find(Class_test(:,i)==max(Class_test(:,i)));
end
