X1=[0.1 6.8 -3.5 2.0 4.1 3.1 -0.8 0.9 5.0 3.9];
Y1=[1.1 7.1 -4.1 2.7 2.8 5.0 -1.3 1.2 6.4 4.0];
X2=[7.1 -1.4 4.5 6.3 4.2 1.4 2.4 2.5 8.4 4.1];
Y2=[4.2 -4.3 0.0 1.6 1.9 -3.2 -4.0 -6.1 3.7 -2.2];
X3=[-3.0 0.5 2.9 -0.1 -4.0 -1.3 -3.4 -4.1 -5.1 1.9];
Y3=[-2.9 8.7 2.1 5.2 2.2 3.7 6.2 3.4 1.6 5.1];
%Z1=ones(1,length(X1));
%Z2=ones(1,length(X2));
%X2_normal = -X2;
%Y2_normal = -Y2;
%Z2_normal = -1.*ones(1,length(X2));
%plot(X1,Y1,'*',X2,Y2,'O');
plot(X3,Y3,'+',X2,Y2,'O');
%plot3(X1,Y1,Z1,'*',X2,Y2,Z2,'o');
hold on
grid on
X=-10:.1:10;
%Y=(30.4*X-34)/34.1;
Y=(41.4*X-19)/48.6;
plot(X,Y);
title('二维平面下w3和w2两类点的分类直线');
%title('二维平面下w1和w2两类点的分类直线');
xlabel('x');ylabel('y');
%legend('w1','w2','w1和w2分界线');\
legend('w3','w2','w3和w2分界线');
%[X,Y]=meshgrid(X);
%Z=30.4/34*X-34.1/34*Y;
%mesh(X,Y,Z);